w11d02-rails-views/cup-manager/app/controllers/cups_controller.rb

  def index
    @cups = Cup.all
---
SELECT "cups".* FROM "cups"

  def show
    @cup = Cup.find(params[:id])
---
SELECT  "cups".* FROM "cups" WHERE "cups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    cup_params = params.require(:cup).permit(:color, :capacity, :material)
    @cup = Cup.create(cup_params)
---
INSERT INTO "cups" ("capacity", "color", "material", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["capacity", 4.0], ["color", "brown"], ["material", "dirt"], ["created_at", "2019-01-28 11:28:47.916495"], ["updated_at", "2019-01-28 11:28:47.916495"]]

  def edit
    @cup = Cup.find(params[:id])
---
SELECT  "cups".* FROM "cups" WHERE "cups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def update
    cup_params = params.require(:cup).permit(:color, :capacity, :material)
    @cup = Cup.find(params[:id])
    @cup.update(cup_params)
---
SELECT  "cups".* FROM "cups" WHERE "cups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cups" SET "capacity" = $1, "material" = $2, "updated_at" = $3 WHERE "cups"."id" = $4  [["capacity", 8.0], ["material", "ceramic!!!"], ["updated_at", "2019-01-28 11:34:06.581836"], ["id", 2]]

  def destroy
    Cup.find(params[:id]).destroy
---
SELECT  "cups".* FROM "cups" WHERE "cups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "cups" WHERE "cups"."id" = $1  [["id", 4]]